МояКонфа/src/Documents/пр_Договор2/пр_Договор2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пр_Договор2</name>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКонтракта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СтатусыДоговора</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>КодОборудования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерБлока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТехХарактеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МояКонфа/src/Documents/пр_Договор2/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Документ Excel (*.xls, *.xlsx)|*.xls;*.xlsx";
	Диалог.МножественныйВыбор=Ложь;
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузкаНаКлиентеЕксель();
КонецПроцедуры

&НаКлиенте
Функция УбратьСимволы(строка_)
		строка_ = СтрЗаменить(строка_," ","");
		строка_ = СтрЗаменить(строка_,Символы.ПС,"");
		строка_ = СтрЗаменить(строка_,Символы.Таб,"");
		строка_ = СтрЗаменить(строка_,Символы.ВТаб,"");
	
	Возврат строка_;
КонецФункции


&НаКлиенте
Процедура ЗагрузкаНаКлиентеЕксель()
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.DisplayAlerts = 0;
		Эксель.Visible = 0;
	Исключение
   		Сообщить(ОписаниеОшибки()); 
   		Возврат;
	КонецПопытки;
	
	
	стЗаписываемыеКолонки = Новый Соответствие;
	стЗаписываемыеКолонки.Вставить("!Субпоставщик","Поставщик");
	стЗаписываемыеКолонки.Вставить("!№Контракта","Номер");
	стЗаписываемыеКолонки.Вставить("ДатаКонтрактасЗИ","Дата");
	
	стЗаписываемыеКолонкиТЧТовар = Новый Соответствие;
	стЗаписываемыеКолонкиТЧТовар.Вставить("КодпоKKS,MCS2","КодОборудования");
	стЗаписываемыеКолонкиТЧТовар.Вставить("Наименование","Наименование");
	стЗаписываемыеКолонкиТЧТовар.Вставить("!№БЛ","НомерБлока");

	ЭксельКнига = Эксель.Workbooks.Open(ИмяФайла);	
	КоличествоСтраниц = ЭксельКнига.Sheets.Count;
	
	Для НомерЛиста = 1 По КоличествоСтраниц Цикл 
		Лист = ЭксельКнига.Sheets(НомерЛиста);
		КоличествоСтрок = Лист.Cells(1, 1).SpecialCells(11).Row;
		КоличествоКолонок = Лист.Cells(1, 1).SpecialCells(11).Column;
		строкаШапка = Лист.Cells(2, 1) ;

		
		Для НомерСтроки = 3 По КоличествоСтрок Цикл 
			ДанныеСтроки = Новый Структура;
			ДанныеСтрокиТЧтовар = Новый Структура;
			
			Для НомерКолонки = 1 По КоличествоКолонок Цикл

				
				ИмяКолонки1С = стЗаписываемыеКолонки.Получить(УбратьСимволы(строкаШапка.Columns(НомерКолонки).value));
				ИмяКолонки1СТовар = стЗаписываемыеКолонкиТЧТовар.Получить(УбратьСимволы(строкаШапка.Columns(НомерКолонки).value));
				ИмяКолонкиЕкс = строкаШапка.Columns(НомерКолонки).value;
				
				ЗначениеВЯчейке = Лист.Cells(НомерСтроки, строкаШапка.Columns(НомерКолонки).Column).Value;

				Если  ИмяКолонки1С <> Неопределено Тогда
					ДанныеСтроки.Вставить(ИмяКолонки1С,  ЗначениеВЯчейке);
				КонецЕсли;
				
				Если  ИмяКолонки1СТовар <> Неопределено Тогда
					ДанныеСтрокиТЧтовар.Вставить(ИмяКолонки1СТовар,  ЗначениеВЯчейке);
				КонецЕсли;
				    
				
			КонецЦикла;
			
			
			
			ЗаполнитьЗначенияСвойств(ЭтаФорма.Объект,ДанныеСтроки);
			Артикул="";
			ДанныеСтрокиТЧтовар.Свойство("КодОборудования",Артикул);
			ДанныеСтрокиТЧтовар.Вставить("Номенклатура",НайтиНоменклатуру(Артикул));
			строкаТЧ = ЭтотОбъект.Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(строкаТЧ,ДанныеСтрокиТЧтовар);
			
			
			
			
			//Возврат;
		КонецЦикла;	
		Прервать;
	КонецЦикла;
	
	Эксель.Workbooks.Close();
	Эксель.Application.Quit();
КонецПроцедуры

Функция НайтиНоменклатуру(Артикул)
	
	Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул);
	Возврат Номенклатура;
	
КонецФункции


&НаКлиенте
Процедура Обработать(Команда)
	//ИндексСтроки = Объект.Товары.Индекс(Элементы.Товары.ТекущиеДанные);
	//ВыделеннаяСтрока = Объект.Товары.Получить(ИндексСтроки);
	
	Оповещение = Новый ОписаниеОповещения("ОтветНаВопрос", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Желаете внести изменения в оборудование?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
	
	//Режим = РежимДиалогаВопрос.ДаНет;
	//Ответ = Вопрос(НСтр("ru = 'Желаете внести изменения в оборудование?'"), Режим, 0);
	//Если Ответ = КодВозвратаДиалога.Нет Тогда
	//	Возврат;
	//КонецЕсли;
	//Если Не ЗначениеЗаполнено(ВыделеннаяСтрока.Номенклатура) Тогда
	//	Режим = РежимДиалогаВопрос.ДаНет;
	//	Ответ = Вопрос(НСтр("ru = 'Оборудование не приходило из SPF! "+Символы.ПС+"Загрузить оборудование с текущими данными?'"), Режим, 0);
	//	Если Ответ = КодВозвратаДиалога.Нет Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
 //   соот = Новый Соответствие;
 //   
 //   соот.Вставить("Номенклатура",ВыделеннаяСтрока.Номенклатура);
 //   соот.Вставить("КодОборудования",ВыделеннаяСтрока.КодОборудования);
 //   соот.Вставить("НомерБлока",ВыделеннаяСтрока.НомерБлока);
 //   соот.Вставить("ТехХарактеристика",ВыделеннаяСтрока.ТехХарактеристика);
 //   соот.Вставить("Наименование",ВыделеннаяСтрока.Наименование);

 //   
 //   ВыделеннаяСтрока.Номенклатура = ЗаписатьВоборудования(соот);
 //   
 //   ВыделеннаяСтрока.флТехХарактеристика = Истина;
 //   ВыделеннаяСтрока.флКодОборудования = Истина;
 //   ВыделеннаяСтрока.флНомерБлока = Истина;
 //   ВыделеннаяСтрока.флНаименование = Истина;
 //
 //   
 //   РаскраситьСтрокиКрасным("флТехХарактеристика") ;	
 //   РаскраситьСтрокиКрасным("флКодОборудования") ; 
 //   РаскраситьСтрокиКрасным("флНомерБлока") ;
 //   РаскраситьСтрокиКрасным("флНаименование") ;

 //   ПараметрыЗаписи = Новый Структура;
 //   ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
 //   ЭтаФорма.Записать(ПараметрыЗаписи);	


КонецПроцедуры

&НаКлиенте 
Процедура ОтветНаВопрос(Результат, ДополнительныеПараметры)  Экспорт 
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	ИндексСтроки = Объект.Товары.Индекс(Элементы.Товары.ТекущиеДанные);
	ВыделеннаяСтрока = Объект.Товары.Получить(ИндексСтроки);	
	
	соот = Новый Соответствие;
	
	соот.Вставить("Номенклатура",ВыделеннаяСтрока.Номенклатура);
	соот.Вставить("КодОборудования",ВыделеннаяСтрока.КодОборудования);
	соот.Вставить("НомерБлока",ВыделеннаяСтрока.НомерБлока);
	соот.Вставить("ТехХарактеристика",ВыделеннаяСтрока.ТехХарактеристика);
	соот.Вставить("Наименование",ВыделеннаяСтрока.Наименование);

	
	СсылкаНоменклатуры = ЗаписатьВоборудования(соот);
	ВыделеннаяСтрока.Номенклатура = СсылкаНоменклатуры;
	

	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
	ЭтаФорма.Записать(ПараметрыЗаписи);		
	
КонецПроцедуры  


&НаСервере
Функция ЗаписатьВоборудования(ВыделеннаяСтрока)
	
	Номенклатура = ВыделеннаяСтрока.Получить("Номенклатура");
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Номенклатура = Номенклатура.ПолучитьОбъект();
	Иначе
	    Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
	КонецЕсли;
	
	Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Оборудование");
	Номенклатура.Артикул =  ВыделеннаяСтрока.Получить("КодОборудования");
	Номенклатура.пр_ТехническиеХарактеристики =  ВыделеннаяСтрока.Получить("ТехХарактеристика");
	Номенклатура.пр_НомерБлока =  ВыделеннаяСтрока.Получить("НомерБлока");
	Номенклатура.Наименование =  ВыделеннаяСтрока.Получить("Наименование");
	Номенклатура.НаименованиеПолное =  ВыделеннаяСтрока.Получить("Наименование");

	Номенклатура.Записать();
	Возврат Номенклатура.Ссылка;
КонецФункции
